{
    "letter": {
        "narration": [
            {
                "text": "Greetings Adventurer! This is an urgent letter! It bears the mark of the King of outerlands. It would not be wise to keep him waiting.",
                "char": "narration"
            },
            {
                "text": "To any able bodied adventurer, Dreary cove town has not sent their taxes in nearly three months. My subjects love paying taxes, who doesn't?",
                "char": "narration"
            },
            {
                "text": "Recently there have been terrible rumors and I fear the worst! Talk of the undead has surfaced and I need you to silence these troubles.",
                "char": "narration"
            },
            {
                "text": "With haste, head to the town and investigate! If you are able to determine and fix the problem, you will be rewarded with 200 gold pieces.",
                "char": "narration"
            },
            {
                "text": "Time is of utmost importance here, I fear someone is trying to raise an undead army. Signed, King Erich",
                "char": "narration"
            }
        ]
    },
    "woods": {
        "startnarration": [
            {
                "text": "After a short journey you approach the outskirts of Dreary Cove and you begin to hear screaming and what sounds like battle.",
                "char": "narration"
            },
            {
                "text": "As you pick up your pace, you spot a townsperson making a break for it in your direction.",
                "char": "narration"
            }
        ],
        "dialogue": [
            {
                "text": "What are you crazy? You’re supposed to run away!",
                "char": "oldman"
            },
            {
                "text": "What's going on?",
                "char": "hero"
            },
            {
                "text": "Zombies are overrunning Dreary Cove! Stay as far away as you can!",
                "char": "oldman"
            },
            {
                "text": "You're just going to leave everyone behind?",
                "char": "hero"
            },
            {
                "text": "I’m just an old man, I can’t fight zombies!",
                "char": "oldman"
            },
            {
                "text": "Are you from Dreary Cove?",
                "char": "hero"
            },
            {
                "text": "Obviously, are you daft?",
                "char": "oldman"
            }
        ],
        "endnarration": [
            {
                "text": "In his haste to escape, a POTION falls out of the old man's robes.",
                "char": "narration"
            },
            {
                "text": "As you pick it up, you notice another figure slowly making its' way towards you.",
                "char": "narration"
            },
            {
                "text": "Once it gets close enough, you see that although it's better looking than the old man, it's definitely a zombie.",
                "char": "narration"
            }
        ],
        "afterzombiedies": [
            {
                "text": "The zombie falls and is lifeless, you continue on your way to Dreary Cove",
                "char": "narration"
            }
        ]
    },
    "town": {
        "startnarration": [
            {
                "text": "As you enter the town you notice the poor conditions all around.",
                "char": "narration"
            },
            {
                "text": "Zombies and villagers alike litter the ground and only three structures remain standing.",
                "char": "narration"
            }
        ],
        "entertown": [
            {
                "text": "You slowly enter the house ready for anything.",
                "char": "narration"
            }
        ]
    },
    "house": {
        "penterhouse": [
            {
                "text": "It's nearly silent except for some rustling at the back of the house.",
                "char": "narration"
            }
        ],
        "childenterhouse": [
            {
                "text": "A small dirty child crawls out from his hiding spot.",
                "char": "narration"
            }
        ],
        "dialogue": [
            {
                "text": "'Ahhh a zombie!'",
                "char": "child"
            },
            {
                "text": "'Wait you're just ugly, are you here to save us?'",
                "char": "child"
            },
            {
                "text": "'Where's your family?'",
                "char": "hero"
            },
            {
                "text": "'My grandpa just ran off, I'm all alone.'",
                "char": "child"
            },
            {
                "text": "'Can you help me?'",
                "char": "hero"
            },
            {
                "text": "'Here, my grandpa says these make you feel better. You should take it.'",
                "char": "child"
            },
            {
                "text": "'How'd you survive?'",
                "char": "hero"
            },
            {
                "text": "'I just ran and hid, I'm so scared.'",
                "char": "child"
            }
        ]
    },
    "tavern": {
        "pentertavern": [
            {
                "text": "You swing the doors of the tavern open.",
                "char": "narration"
            }
        ],
        "startnarration": [
            {
                "text": "The Spooky Tap may have been nice at one point, but that time is long gone.",
                "char": "narration"
            },
            {
                "text": "Sprawled out in the middle of a table is a large detailed map of the area. There's a large X right on a cave not far from town.",
                "char": "narration"
            },
            {
                "text": "Next to the map is a note that reads 'Map to secret hideout. Burn after reading! -Lord of Bones'",
                "char": "narration"
            }
        ]
    },
    "temple": {
        "pentertemple": [
            {
                "text": "You enter the church through a shattered stain glass window.",
                "char": "narration"
            }
        ],
        "startnarration": [
            {
                "text": "Immediately catching your eye, you see a zombie shambling through the pews.",
                "char": "narration"
            },
            {
                "text": "It notices you too and begins to attack.",
                "char": "narration"
            }
        ],
        "afterzombiedies": [
            {
                "text": "The zombie falls over motionless. As you search the body you notice writing on the zombies clothing.",
                "char": "narration"
            },
            {
                "text": "It reads 'If lost return to Lord of Bone's secret cave 1 mile down the road from Dreary Cove.'",
                "char": "narration"
            },
            {
                "text": "While there was nearly nothing left of the town, everything pointed you to a cave close to town.",
                "char": "narration"
            }
        ]
    },
    "cave1": {
        "startnarration": [
            {
                "text": "The cave is lit by torches and as you traverse further in you hear the distinct sound of two human voices.",
                "char": "narration"
            },
            {
                "text": "Before you stands two figures. One with a skull face, and the other with a red mask.",
                "char": "narration"
            }
        ],
        "dialogue": [
            {
                "text": "'And then I just ran away Hahahaha! That zombie must have eaten him fo... How'd you get in here?'",
                "char": "maskman"
            },
            {
                "text": "'It matters not, you won't make it out of here alive and our zombie army will kill the king! No more taxes for us muahahahha!'",
                "char": "maskman"
            },
            {
                "text": "The man in the red mask charges at you!",
                "char": "maskman"
            },
            {
                "text": "You've won the fight, but the henchman isn't convinced.",
                "char": "maskman"
            },
            {
                "text": "'You think i've been beaten? Nothing you can do will sto..'",
                "char": "maskman"
            },
            {
                "text": "The man in the red mask has a heart attack and dies. As he falls over his mask shatters revealing the old man you saw earlier.",
                "char": "maskman"
            }
        ]
    },
    "cave2": {
        "startnarration": [
            {
                "text": "The second figure with the skull mask turns and addresses you for the first time.",
                "char": "narration"
            }
        ],
        "dialogue": [
            {
                "text": "'Thank you, he was beyond annoying'",
                "char": "bonelord"
            },
            {
                "text": "'Wasn't he your friend?'",
                "char": "hero"
            },
            {
                "text": "'No, simply an obnoxious old man.'",
                "char": "bonelord"
            },
            {
                "text": "'Why are you doing this?'",
                "char": "hero"
            },
            {
                "text": "'Well to rule the kingdom of course.'",
                "char": "bonelord"
            },
            {
                "text": "'Who are you?'",
                "char": "hero"
            },
            {
                "text": "'What? You mean you don't recognize me? Oooh I'm so scared, save me. I can't believe you bought that muahahaha!'",
                "char": "bonelord"
            },
            {
                "text": "'Enough talk, time to end this!'",
                "char": "bonelord"
            }
        ]
    },
    "castle": {
        "startnarration": [
            {
                "text": "After a tough battle, the lord of bones falls. Exhausted, you gather proof of your victory and prepare to return to the King.",
                "char": "narration"
            },
            {
                "text": "You enter the castle and show your proof of victory to the king.",
                "char": "narration"
            }
        ],
        "dialogue": [
            {
                "text": "'Brave adventurer, you have done the impossible! I cannot express how much you've done for this kingdom. Let the taxes flow!'",
                "char": "king"
            },
            {
                "text": "'Oh, before I forget, heres your payment of 150 ahmph I mean 200 gold pieces.'",
                "char": "king"
            },
            {
                "text": "King Erich:'You've proven your worth, how would you feel about completing more quests for me?'",
                "char": "king"
            }
        ]
    }
}